// src/pages/Settlement.jsx
import React from "react";

const Settlement = () => {
  return (
    <div className="relative min-h-screen font-vazirmatn text-gray-900" dir="rtl">
      {/* Background */}
      <svg
        className="absolute inset-0 -z-10 w-full h-full"
        xmlns="http://www.w3.org/2000/svg"
        preserveAspectRatio="none"
        viewBox="0 0 100 100"
      >
        <rect width="100" height="100" fill="#F3F4F6" />
      </svg>

      <div className="max-w-5xl mx-auto p-8 sm:p-12">
        <h1 className="text-4xl font-extrabold mb-8 border-b-4 border-indigo-600 pb-2 text-right">
          زمان تسویه حساب ریالی و ارزی
        </h1>

        <article className="space-y-6 text-justify text-right leading-relaxed whitespace-pre-line">
          {`
تسویه حساب ارزی:

برای خرید اول کاربر، تسویه و ارسال ارز حداکثر 24 ساعت پس از ثبت سفارش انجام خواهد شد و برای خرید های بعدی تمامی تراکنش ها به صورت آنی و بلافاصله پس از ثبت و تکمیل‌ سفارش توسط کاربر بصورت اتوماتیک صورت خواهد گرفت.

تسویه حساب ریالی:

باتوجه به سیکل های تسویه پایا ، زمان‌ بندی تسویه ریالی تم ایکس به شرح زیر است:
* درخواست های تسویه کاربران صرفا در روزهای کاری و مطابق با سیکل پایا صورت می‌گیرد.
* درخواست‌های ثبت شده در روزهای کاری تا ساعت 11:30، در سیکل 12:45 همان روز تسویه خواهد شد.
* درخواست‌های بعد از ساعت 11:30 تا 10 شب، روز کاری بعد ساعت 3:45 صبح تسویه می‌شود.
* درخواست‌های بین 10 شب تا 9 صبح، در ساعت 10:45 صبح تسویه خواهند شد.

نکته: بسته به بانک مقصد ممکن است تفاوت‌هایی در زمان واریز وجود داشته باشد و پس از ارسال از تم ایکس خارج می‌شود.

تسویه ریالی مقصد بانک آینده:

* از ساعت 9 تا 21 در روزهای کاری، هر یک ساعت یکبار انجام می‌شود.
* درخواست‌های قبل از دقیقه 45 هر ساعت، در همان ساعت تسویه می‌شوند.
* درخواست‌های بین ساعت 21 تا 22، ساعت 23 تسویه می‌شود.
* درخواست‌های بعد از ساعت 22، در اولین سیکل روز بعد انجام می‌گردد.
* در روزهای تعطیل، هر سه ساعت یکبار تسویه انجام می‌شود.

توجه: تیم تم ایکس تلاش دارد تسویه‌های بانک‌های ملت، سامان و آینده را آنی (بین ۵ تا ۶۰ دقیقه) انجام دهد ولی حالت معمول همان سیکل‌های پایا است.
          `}
        </article>
      </div>
    </div>
  );
};

export default Settlement;
